# Customer API - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-urXwUVytWdfMXG9c

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.aws_ssm_parameter.username: Refreshing state... [id=customer-api-staging-customer-api-username]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=ibl9uk3da1]
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-customer-api-staging-customer-api]
module.database_user.aws_ssm_parameter.password: Refreshing state... [id=customer-api-staging-customer-api-password]
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230423113940606000000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=072ca24b8949667c991bcd7160e11abd968055b2]
data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=l2hfktq]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=pyrxf9t]
module.aws_lambda.aws_iam_role.default: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = (known after apply)
    }

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-customer-api-staging-customer-api"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = "postgresql://customer-api:FLX3Pt3-pkxR%7B%3FoUu%21fj%3Ep%21Dv99BDU1u-sGq%23c%23HKK57cGIq$NyTF&lZ1OwR%7Be%25v@customer-shared-staging-customer-4496.6xw.cockroachlabs.cloud:26257/customer?sslmode=verify-full"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.aws_ssm_parameter.password will be destroyed
  # (because aws_ssm_parameter.password is not in configuration)
  - resource "aws_ssm_parameter" "password" {
      - arn       = "arn:aws:ssm:ap-southeast-1:514472330244:parameter/customer-api-staging-customer-api-password" -> null
      - data_type = "text" -> null
      - id        = "customer-api-staging-customer-api-password" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "customer-api-staging-customer-api-password" -> null
      - tags      = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "customer-api"
          - "resource_type" = "database_user"
        } -> null
      - tags_all  = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "customer-api"
          - "resource_type" = "database_user"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 2 -> null
    }

  # module.database_user.aws_ssm_parameter.username will be destroyed
  # (because aws_ssm_parameter.username is not in configuration)
  - resource "aws_ssm_parameter" "username" {
      - arn       = "arn:aws:ssm:ap-southeast-1:514472330244:parameter/customer-api-staging-customer-api-username" -> null
      - data_type = "text" -> null
      - id        = "customer-api-staging-customer-api-username" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "customer-api-staging-customer-api-username" -> null
      - tags      = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "customer-api"
          - "resource_type" = "database_user"
        } -> null
      - tags_all  = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "customer-api"
          - "resource_type" = "database_user"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.database_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-api" -> (known after apply)
      ~ name       = "customer-api" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.database_user.random_integer.username_suffix will be created
  + resource "random_integer" "username_suffix" {
      + id     = (known after apply)
      + max    = 50000
      + min    = 1
      + result = (known after apply)
    }

Plan: 2 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ customer_database_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*